In [1]:
import pandas as pd

In [13]:
#Задача 1
ratings = pd.read_csv('C:/Users/Dmitry/Desktop/курс питон/ml-latest-small/ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [14]:
movies = pd.read_csv('C:/Users/Dmitry/Desktop/курс питон/ml-latest-small/movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [60]:
joined = movies.merge(ratings, on='movieId', how='left')
joined.head()

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1.0,4.0,9.649827e+08
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,5.0,4.0,8.474350e+08
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,7.0,4.5,1.106636e+09
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,15.0,2.5,1.510578e+09
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,17.0,4.5,1.305696e+09

In [99]:
joined[joined['rating']==5.0]['title'].value_counts().head(1)

Shawshank Redemption, The (1994)    153
Name: title, dtype: int64

In [82]:
#joined.title.unique()

array(['Toy Story (1995)', 'Jumanji (1995)', 'Grumpier Old Men (1995)',
       ..., 'Flint (2017)', 'Bungo Stray Dogs: Dead Apple (2018)',
       'Andrew Dice Clay: Dice Rules (1991)'], dtype=object)

In [95]:
#joined.groupby('title')['rating'].value_counts()

title                                      rating
'71 (2014)                                 4.0       1
'Hellboy': The Seeds of Creation (2004)    4.0       1
'Round Midnight (1986)                     3.5       2
'Salem's Lot (2004)                        5.0       1
'Til There Was You (1997)                  3.0       1
                                                    ..
¡Three Amigos! (1986)                      3.5       4
                                           2.5       3
                                           5.0       2
                                           1.0       1
À nous la liberté (Freedom for Us) (1931)  1.0       1
Name: rating, Length: 30413, dtype: int64

SyntaxError: invalid syntax (<ipython-input-96-1d1ff70fb7d9>, line 1)

In [5]:
#Задача 2
power=pd.read_csv('C:/Users/Dmitry/Desktop/курс питон/Основы pandas/power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [4]:
summ=0

power2=power[(power['year']>=2005)&(power['year']<=2010)&(power['quantity']>0)]
power3=power2[power2.category.isin([4,12,21])]
summ=power3[power3.country.str.contains('|'.join(['Lat','Lit','Est']))]['quantity'].sum()
print('суммарное потребление: {}'.format(summ))

суммарное потребление: 240580.0

In [14]:
#Задача 3
#page_url = 'https://fortrader.org/quotes'
#df = pd.read_html(page_url, attrs = {'class': 'tabl_quotes'}, encoding='utf-8')

In [11]:
pd.read_html('https://fortrader.org/quotes')[0]

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0  EURRUB Курс евро к рублю сегодня  83.34      -0.13         -0.16        NaN
1       USDRUB Курс рубля к доллару  73.77       0.02          0.03        NaN